<template>
  <b-section :title="title" :descs="descs" :image-ref="imageRef" />
</template>

<script setup lang="ts">
import BSection from '@/components/UI/BSection.vue'

const title = 'Об аниме'
const descs = [
	'Haikyu!! — аниме о волейболе, выпущенное студией Production I.G, известная своими произведениями в спортивном жанре: ранее она выпустила экранизацию Kuroko no Basuke о баскетболе, Tennis no Ouji-sama и Diamond No Ace о бейсболе. Сценарий основан на манге.',

	'Один случайный матч зажёг в Сёё Хинате безумную любовь к волейболу. Хоть в его волейбольном клубе изначально не было даже участников, упорством и стараниями Сёё собравшаяся команда всё-таки прорвалась в свой первый и последний финальный матч в средней школе. Но там она была начисто разгромлена Тобио Кагэямой, известным как Король площадки. Поклявшись отомстить, Хината вступает в клуб волейбола в старшей школе Карасуно и лицом к лицу сталкивается со своим ненавистным противником Кагэямой.'
]
const imageRef = 'src/assets/images/home/about_anime.png'
</script>

<style>
p {
    white-space: pre-line;
}
</style>